{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v2.0.1", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "htrModel", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 720, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "batch_input_shape": [null, 720, 64], "dtype": "float32", "target_shape": [720, 64, 1]}, "name": "reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d", "inbound_nodes": [[["leaky_re_lu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [1, 2], "padding": "valid", "strides": [1, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_2", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_3", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_5", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "dtype": "float32", "pool_size": [1, 2], "padding": "valid", "strides": [1, 2], "data_format": "channels_last"}, "name": "max_pooling2d_4", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "dtype": "float32", "alpha": 0.009999999776482582}, "name": "leaky_re_lu_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "dtype": "float32", "pool_size": [1, 2], "padding": "valid", "strides": [1, 2], "data_format": "channels_last"}, "name": "max_pooling2d_5", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [90, 512]}, "name": "reshape_1", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 512, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape": [90, 1, 1024]}, "name": "reshape_2", "inbound_nodes": [[["bidirectional", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_7", "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_3", "trainable": true, "dtype": "float32", "target_shape": [90, 80]}, "name": "reshape_3", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["reshape_3", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.7926678657531738, "scale": 0.0013929455888037588, "original_dtype": "float32"}}, {"name": "batch_normalization/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4298136830329895, "scale": 0.0013782848914464314, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -433.22963627833946, "scale": 3.0295778760723038, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 4108.33935546875, "scale": 73.84307789522059, "original_dtype": "float32"}}, {"name": "batch_normalization_1/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.8028653264045715, "scale": 0.0013040624412835812, "original_dtype": "float32"}}, {"name": "batch_normalization_1/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3960537910461426, "scale": 0.0013635338375381394, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -25.27275893267463, "scale": 0.17310108857996323, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 243.90231323242188, "scale": 2.316245284734988, "original_dtype": "float32"}}, {"name": "bidirectional/forward_lstm/lstm_cell_1/kernel", "shape": [512, 2048], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3562682722129074, "scale": 0.0028052619859284048, "original_dtype": "float32"}}, {"name": "bidirectional/forward_lstm/lstm_cell_1/recurrent_kernel", "shape": [512, 2048], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.672395896911621, "scale": 0.004944087477291331, "original_dtype": "float32"}}, {"name": "bidirectional/forward_lstm/lstm_cell_1/bias", "shape": [2048], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17712587410328434, "scale": 0.005060739260093839, "original_dtype": "float32"}}, {"name": "bidirectional/backward_lstm/lstm_cell_2/kernel", "shape": [512, 2048], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3400884469350179, "scale": 0.0028578861086976295, "original_dtype": "float32"}}, {"name": "bidirectional/backward_lstm/lstm_cell_2/recurrent_kernel", "shape": [512, 2048], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.7373264656347387, "scale": 0.005304506947012509, "original_dtype": "float32"}}, {"name": "bidirectional/backward_lstm/lstm_cell_2/bias", "shape": [2048], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2597670656793258, "scale": 0.005526958844240974, "original_dtype": "float32"}}, {"name": "conv2d/kernel", "shape": [5, 5, 1, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.27900939934393937, "scale": 0.0017222802428638233, "original_dtype": "float32"}}, {"name": "conv2d/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15445164745929194, "scale": 0.0015922850253535252, "original_dtype": "float32"}}, {"name": "conv2d_1/kernel", "shape": [5, 5, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5167082241937225, "scale": 0.003539097425984401, "original_dtype": "float32"}}, {"name": "conv2d_1/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3030388874166152, "scale": 0.001562056120704202, "original_dtype": "float32"}}, {"name": "conv2d_2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.33955893937279197, "scale": 0.002806272226221421, "original_dtype": "float32"}}, {"name": "conv2d_2/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.002393808407599435, "scale": 2.196154502384803e-05, "original_dtype": "float32"}}, {"name": "conv2d_3/kernel", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4592214612399831, "scale": 0.003061476408266554, "original_dtype": "float32"}}, {"name": "conv2d_3/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.10002820684629328, "scale": 0.0007196273873834049, "original_dtype": "float32"}}, {"name": "conv2d_4/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3915179402220483, "scale": 0.0025757759225134755, "original_dtype": "float32"}}, {"name": "conv2d_4/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09097554192823523, "scale": 0.0007220281105415494, "original_dtype": "float32"}}, {"name": "conv2d_5/kernel", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3291441605371587, "scale": 0.0029652627075419705, "original_dtype": "float32"}}, {"name": "conv2d_5/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0031399815781589816, "scale": 2.2753489696804215e-05, "original_dtype": "float32"}}, {"name": "conv2d_6/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.38054988980293275, "scale": 0.0025887747605641684, "original_dtype": "float32"}}, {"name": "conv2d_6/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09194688703499587, "scale": 0.0005746680439687242, "original_dtype": "float32"}}, {"name": "conv2d_7/kernel", "shape": [1, 1, 1024, 80], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.4267571416555667, "scale": 0.011414057133244533, "original_dtype": "float32"}}, {"name": "conv2d_7/bias", "shape": [80], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07698062792712566, "scale": 0.0008103223992329018, "original_dtype": "float32"}}]}]}